***GO_STP_71: SURAJ SANJEEV PAWAR***

**Goeduhub Technologies**<br>
***https://www.goeduhub.com/***

**Assignment/Task 5**<br>
***Online Summer training on Machine Learning & Data Science With Python***

***IMDB data from 2006 to 2016***<br>
A data set of 1,000 popular movies on IMDB in the last 10 years
Here's a data set of 1,000 most popular movies on IMDB in the last 10 years. The data fields included are:<br>

Title, Genre, Description, Director, Actors, Year, Runtime, Rating, Votes, Revenue, Metascrore

***Pandas - Data Analysis of IMDB movies data***<br>
As we have a basic understanding of the different data structures in Pandas, let’s explore the fun and interesting ‘IMDB-movies-dataset’ and get our hands dirty by performing practical data analysis on real data.

It is an open-source dataset and you can download it from this link.<br>
https://www.kaggle.com/PromptCloudHQ/imdb-data<br>
We will read the data from the .csv file and perform the following basic operations on movies data

###***Steps for presenting the flow to the given dataset:***

1.Load the IMDb Dataset and read.<br>
2.View the dataset.<br>
3.Understand some basic information about the dataset and Inspect the dataframe.<br> 
4.Inspect the dataframe's columns, shapes, variable types etc.<br>
5.Data Selection – Indexing and Slicing data.<br>
6.Data Selection – Based on Conditional filtering.<br>
7.Groupby operations.<br>
8.Sorting operation.<br>
9.Dealing with missing values.<br>
10.Dropping columns and null values.<br>
11.Apply( ) functions.<br>

In [25]:
#import the required libraries
import numpy as np  #it contains many functions for numerical computation
import pandas as pd  #it allows to manipulate and analyze data (dataframes).
import seaborn as sns  #it complements Matplotlib by providing attractive statistical graphics.
import matplotlib.pyplot as plt  #it allows to trace and visualize data in the form of graphs.

In [26]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [27]:
path='drive/My Drive/Datasets'

***1.Load the IMDb Dataset and read***

In [28]:
import pandas as pd
dataset=pd.read_csv(path+"/IMDB-Movie-Data.csv")

***2.View the dataset***

In [29]:
#get the first top 5 values
dataset.head()

   Rank                    Title  ... Revenue (Millions) Metascore
0     1  Guardians of the Galaxy  ...             333.13      76.0
1     2               Prometheus  ...             126.46      65.0
2     3                    Split  ...             138.12      62.0
3     4                     Sing  ...             270.32      59.0
4     5            Suicide Squad  ...             325.02      40.0

[5 rows x 12 columns]

In [30]:
#get the bottom 5 values
dataset.tail()

     Rank                   Title  ... Revenue (Millions) Metascore
995   996    Secret in Their Eyes  ...                NaN      45.0
996   997         Hostel: Part II  ...              17.54      46.0
997   998  Step Up 2: The Streets  ...              58.01      50.0
998   999            Search Party  ...                NaN      22.0
999  1000              Nine Lives  ...              19.64      11.0

[5 rows x 12 columns]

In [34]:
dataset.columns

Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

***3.Understand some basic information about the dataset and Inspect the dataframe Inspect the dataframe's columns, shapes, variable types etc.***

In [35]:
#get the information about the given dataset
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  872 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

In [36]:
#get the shape of the dataset
dataset.shape

(1000, 12)

In [37]:
##get the statictical information using the dataset
dataset.describe()

              Rank         Year  ...  Revenue (Millions)   Metascore
count  1000.000000  1000.000000  ...          872.000000  936.000000
mean    500.500000  2012.783000  ...           82.956376   58.985043
std     288.819436     3.205962  ...          103.253540   17.194757
min       1.000000  2006.000000  ...            0.000000   11.000000
25%     250.750000  2010.000000  ...           13.270000   47.000000
50%     500.500000  2014.000000  ...           47.985000   59.500000
75%     750.250000  2016.000000  ...          113.715000   72.000000
max    1000.000000  2016.000000  ...          936.630000  100.000000

[8 rows x 7 columns]

***4.Data Selection – Indexing and Slicing data***

In [38]:
#get the extract dataset as series
genre = dataset['Genre']

***loc are used to locate the rows by name and iloc are used for locates the rows by integer index***

In [39]:
#get the extract dataset as dataframe (loc)
dataset[['Genre']]

                        Genre
0     Action,Adventure,Sci-Fi
1    Adventure,Mystery,Sci-Fi
2             Horror,Thriller
3     Animation,Comedy,Family
4    Action,Adventure,Fantasy
..                        ...
995       Crime,Drama,Mystery
996                    Horror
997       Drama,Music,Romance
998          Adventure,Comedy
999     Comedy,Family,Fantasy

[1000 rows x 1 columns]

In [40]:
#slicing of the given dataset (iloc)
dataset.iloc[10:15][['Title','Rating','Revenue (Millions)']]

                                      Title  Rating  Revenue (Millions)
10  Fantastic Beasts and Where to Find Them     7.5              234.02
11                           Hidden Figures     7.8              169.27
12                                Rogue One     7.9              532.17
13                                    Moana     7.7              248.75
14                                 Colossal     6.4                2.87

***5.Data Selection – Based on Conditional filtering***

In [41]:
#applying the base conditional filtering using the given dataset
dataset[((dataset['Year'] >= 2010) & (dataset['Year'] <= 2016))
      & (dataset['Rating'] < 6.0)
      & (dataset['Revenue (Millions)'] > dataset['Revenue (Millions)'].quantile(0.95))]

     Rank                       Title  ... Revenue (Millions) Metascore
941   942  The Twilight Saga: Eclipse  ...             300.52      58.0

[1 rows x 12 columns]

***6.Groupby operations***

In [42]:
#applying the groupby using some columns using given dataset
dataset.groupby('Director')[['Rating']].mean().head()

                     Rating
Director
Aamir Khan              8.5
Abdellatif Kechiche     7.8
Adam Leon               6.5
Adam McKay              7.0
Adam Shankman           6.3

***7.Sorting operation***

In [43]:
#based on that sorting operations using the dataset
dataset.groupby('Director')[['Rating']].mean().sort_values(['Rating'], ascending=False).head()

                                  Rating
Director
Nitesh Tiwari                       8.80
Christopher Nolan                   8.68
Makoto Shinkai                      8.60
Olivier Nakache                     8.60
Florian Henckel von Donnersmarck    8.50


***8.Dealing with missing values***

In [44]:
#to check null values row-wise
dataset.isnull().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

***9.Dropping columns and null values***

In [46]:
#drop function to drop columns from the given dataset
dataset.drop('Metascore', axis=1).head()

   Rank                    Title  ...   Votes Revenue (Millions)
0     1  Guardians of the Galaxy  ...  757074             333.13
1     2               Prometheus  ...  485820             126.46
2     3                    Split  ...  157606             138.12
3     4                     Sing  ...   60545             270.32
4     5            Suicide Squad  ...  393727             325.02

[5 rows x 11 columns]

In [47]:
#drops all rows containing missing data
dataset.dropna()

     Rank                     Title  ... Revenue (Millions) Metascore
0       1   Guardians of the Galaxy  ...             333.13      76.0
1       2                Prometheus  ...             126.46      65.0
2       3                     Split  ...             138.12      62.0
3       4                      Sing  ...             270.32      59.0
4       5             Suicide Squad  ...             325.02      40.0
..    ...                       ...  ...                ...       ...
993   994  Resident Evil: Afterlife  ...              60.13      37.0
994   995                 Project X  ...              54.72      48.0
996   997           Hostel: Part II  ...              17.54      46.0
997   998    Step Up 2: The Streets  ...              58.01      50.0
999  1000                Nine Lives  ...              19.64      11.0

[838 rows x 12 columns]

In [48]:
#drop all columns containing missing data
dataset.dropna(axis=1)

     Rank                    Title  ... Rating   Votes
0       1  Guardians of the Galaxy  ...    8.1  757074
1       2               Prometheus  ...    7.0  485820
2       3                    Split  ...    7.3  157606
3       4                     Sing  ...    7.2   60545
4       5            Suicide Squad  ...    6.2  393727
..    ...                      ...  ...    ...     ...
995   996     Secret in Their Eyes  ...    6.2   27585
996   997          Hostel: Part II  ...    5.5   73152
997   998   Step Up 2: The Streets  ...    6.2   70699
998   999             Search Party  ...    5.6    4881
999  1000               Nine Lives  ...    5.3   12435

[1000 rows x 10 columns]

In [49]:
dataset.dropna(axis=0, thresh=6)

     Rank                    Title  ... Revenue (Millions) Metascore
0       1  Guardians of the Galaxy  ...             333.13      76.0
1       2               Prometheus  ...             126.46      65.0
2       3                    Split  ...             138.12      62.0
3       4                     Sing  ...             270.32      59.0
4       5            Suicide Squad  ...             325.02      40.0
..    ...                      ...  ...                ...       ...
995   996     Secret in Their Eyes  ...                NaN      45.0
996   997          Hostel: Part II  ...              17.54      46.0
997   998   Step Up 2: The Streets  ...              58.01      50.0
998   999             Search Party  ...                NaN      22.0
999  1000               Nine Lives  ...              19.64      11.0

[1000 rows x 12 columns]


***10.Apply( ) functions***

In [50]:
#using the function based on theclassify movies based on ratings
def rating_group(rating):
    if rating >= 7.5:
        return 'Good'
    elif rating >= 6.0:
        return 'Average'
    else:
        return 'Bad'

In [51]:
#creating a new variable in the dataset to hold the rating category
dataset['Rating_category'] = dataset['Rating'].apply(rating_group)

In [52]:
dataset[['Title','Director','Rating','Rating_category']].head(5)

                     Title              Director  Rating Rating_category
0  Guardians of the Galaxy            James Gunn     8.1            Good
1               Prometheus          Ridley Scott     7.0         Average
2                    Split    M. Night Shyamalan     7.3         Average
3                     Sing  Christophe Lourdelet     7.2         Average
4            Suicide Squad            David Ayer     6.2         Average

***Thank you so much mam and Goeduhub Technologies***